{
    "id": "aditya_hridayam",
    "chapters": [
    {
      "chapter_number": 1,
      "name": "Aditya Hridayam Stotram",
      "summary": "This chapter contains the complete Aditya Hridayam hymn, a powerful prayer dedicated to Surya, the Sun God. It was recited by Sage Agastya to Lord Rama on the battlefield to ensure his victory over Ravana. The hymn praises the Sun God's omnipotence, radiance, and life-giving energy, offering strength, courage, and prosperity to its reciter.",
      "verses_count": 31,
      "verses": [
  {
    "id": "aditya-hridayam-1",
    "verse_number": 1,
    "original": "ततो युद्धपरिश्रान्तं समरे चिन्तया स्थितम्। रावणं चाग्रतो दृष्ट्वा युद्धाय समुपस्थितम्॥",
    "transliteration": "tato yuddhaparīśrāntaṁ samare cintayā sthitam। rāvaṇaṁ cāgrato dṛṣṭvā yuddhāya samupasthitam॥",
    "translations": {
      "english": "Then, seeing Rāmā, weary from battle and absorbed in thought on the battlefield, and Rāvaṇa ready for the fight, Lord Agastya approached."
    }
  },
  {
    "id": "aditya-hridayam-2",
    "verse_number": 2,
    "original": "दैवतैश्च समागम्य द्रष्टुमभ्यागतो रणम्। उपगम्याऽब्रवीद् राममगस्त्यो भगवान् ऋषिः॥",
    "transliteration": "daivataiśca samāgamya draṣṭumabhyāgato raṇam। upagamyā'bravīd rāmamagastyo bhagavān ṛṣiḥ॥",
    "translations": {
      "english": "Lord Agastya, the sage, who had come with the Devas to witness the battle, approached Rāmā and spoke."
    }
  },
  {
    "id": "aditya-hridayam-3",
    "verse_number": 3,
    "original": "राम राम महाबाहो शृणु गुह्यं सनातनम्। येन सर्वानरीन् वत्स समरे विजयिष्यसि॥",
    "transliteration": "rāma rāma mahābāho śṛṇu guhyaṁ sanātanam। yena sarvānarīn vatsa samare vijayiṣyasi॥",
    "translations": {
      "english": "O Rāmā, mighty-armed one, hear this eternal secret, by which, my child, you shall conquer all your enemies on the battlefield."
    }
  },
  {
    "id": "aditya-hridayam-4",
    "verse_number": 4,
    "original": "आदित्यहृदयं पुण्यं सर्वशत्रुविनाशनम्। जयानहं जपेन्नित्यमक्षयं परमं शिवम्॥",
    "transliteration": "ādityahṛdayaṁ puṇyaṁ sarvaśatruvināśanam। jayānahaṁ japennityamakṣayaṁ paramaṁ śivam॥",
    "translations": {
      "english": "This holy hymn, the Heart of Āditya, destroys all enemies, bestows victory, is eternal, and is supremely auspicious."
    }
  },
  {
    "id": "aditya-hridayam-5",
    "verse_number": 5,
    "original": "सर्वमङ्गलमाङ्गल्यं सर्वपापप्रणाशनम्। चिन्ताशोकप्रशमनमायुर्वर्धनमुत्तमम्॥",
    "transliteration": "sarvamaṅgalamāṅgalyaṁ sarvapāpapraṇāśanam। cintāśokapraśamanamāyurvardhanamuttamam॥",
    "translations": {
      "english": "It is the most auspicious of all auspicious things, the destroyer of all sins, the dispeller of anxiety and grief, and the bestower of longevity."
    }
  },
  {
    "id": "aditya-hridayam-6",
    "verse_number": 6,
    "original": "रश्मिमन्तं समुद्यन्तं देवासुरनमस्कृतम्। पूजयस्व विवस्वन्तं भास्करं भुवनेश्वरम्॥",
    "transliteration": "raśmimantaṁ samudyantaṁ devāsuranamaskṛtam। pūjayasva vivasvantaṁ bhāskaraṁ bhuvaneśvaram॥",
    "translations": {
      "english": "Worship Vivasvān (Sun), the radiant one, the rising one, the one revered by Devas and Asuras, the source of light, the Lord of the universe."
    }
  },
  {
    "id": "aditya-hridayam-7",
    "verse_number": 7,
    "original": "सर्वदेवात्मको ह्येष तेजस्वी रश्मिभावनः। एष देवासुरगणाँल्लोकान् पाति गभस्तिभिः॥",
    "transliteration": "sarvadevātmako hyeṣa tejasvī raśmibhāvanaḥ। eṣa devāsuragaṇām̐llokān pāti gabhastibhiḥ॥",
    "translations": {
      "english": "He is the Self of all gods, the radiant one, the source of rays. He nourishes the worlds, including the hosts of Devas and Asuras, with his rays."
    }
  },
  {
    "id": "aditya-hridayam-8",
    "verse_number": 8,
    "original": "एष ब्रह्मा च विष्णुश्च शिवः स्कन्दः प्रजापतिः। महेन्द्रो धनदः कालो यमः सोमो ह्यपां पतिः॥",
    "transliteration": "eṣa brahmā ca viṣṇuśca śivaḥ skandaḥ prajāpatiḥ। mahendro dhanadaḥ kālo yamaḥ somo hyapāṁ patiḥ॥",
    "translations": {
      "english": "He is Brahmā, Viṣṇu, Śiva, Skanda, Prajāpati, the great Indra, Kubera, Time, Yama, Soma, and the Lord of waters (Varuṇa)."
    }
  },
  {
    "id": "aditya-hridayam-9",
    "verse_number": 9,
    "original": "पितरो वसवः साध्या अश्विनौ मरुतो मनुः। वायुर्वह्निः प्रजाप्राण ऋतुकर्ता प्रभाकरः॥",
    "transliteration": "pitaro vasavaḥ sādhyā aśvinau maruto manuḥ। vāyurvahniḥ prajāprāṇa ṛtukartā prabhākaraḥ॥",
    "translations": {
      "english": "He is the Pitṛs (ancestors), Vasus, Sādhyas, Aśvins, Maruts, Manu, Vāyu, Vahni (Fire), the life-breath of all beings, the creator of the seasons, and the source of light."
    }
  },
  {
    "id": "aditya-hridayam-10",
    "verse_number": 10,
    "original": "आदित्यः सविता सूर्यः खगः पूषा गभस्तिमान्। सुवर्णसदृशो भानुर्हिरण्यरेता दिवाकरः॥",
    "transliteration": "ādityaḥ savitā sūryaḥ khagaḥ pūṣā gabhastimān। suvarṇasadṛśo bhānurhiraṇyaretā divākaraḥ॥",
    "translations": {
      "english": "Āditya, Savitā, Sūrya, Khaga (traverser of the sky), Pūṣā, Gabhastimān (full of rays), golden, effulgent, Hiraṇyaretā (golden-germed), and Divākara (day-maker)."
    }
  },
  {
    "id": "aditya-hridayam-11",
    "verse_number": 11,
    "original": "हरिदश्वः सहस्रार्चिः सप्तसप्तिर्मरीचिमान्। तिमिरोन्मथनः शम्भुस्त्वष्टा मार्ताण्डकोऽंशुमान्॥",
    "transliteration": "haridaśvaḥ sahasrārciḥ saptasaptirmarīcimān। timironmathanaḥ śambhustvaṣṭā mārtāṇḍako’ṁśumān॥",
    "translations": {
      "english": "Haridaśva (with yellow horses), Sahasrārciḥ (with a thousand rays), Saptasapti (with seven horses), Marīcimān (full of light), the destroyer of darkness, Śambhu (source of welfare), Tvaṣṭā, Mārtāṇḍa, and Aṁśumān (radiant)."
    }
  },
  {
    "id": "aditya-hridayam-12",
    "verse_number": 12,
    "original": "हिरण्यगर्भः शिशिरस्तपनो भास्करो रविः। अग्निगर्भोऽदितेः पुत्रः शङ्खः शिशिरनाशनः॥",
    "transliteration": "hiraṇyagarbhaḥ śiśirastapano bhāskaro raviḥ। agnigarbho’diteḥ putraḥ śaṅkhaḥ śiśiranāśanaḥ॥",
    "translations": {
      "english": "Hiraṇyagarbha (golden source), Śiśira (mild), Tapana (burner), Bhāskara, Ravi, Agnigarbha (fire-wombed), Aditi’s son, Śaṅkha, and the destroyer of cold."
    }
  },
  {
    "id": "aditya-hridayam-13",
    "verse_number": 13,
    "original": "व्योमनाथस्तमोभेदी ऋग्यजुःसामपारगः। घना वृष्टिरपां मित्रो विन्ध्यवीथीप्लवङ्गमः॥",
    "transliteration": "vyomanāthastamobhedī ṛgyajuḥsāmapāragaḥ। ghanā vṛṣṭirapāṁ mitro vindhyavīthīplavaṅgamaḥ॥",
    "translations": {
      "english": "The Lord of the sky, the dispeller of darkness, the master of the Ṛg, Yajur, and Sāma Vedas. He is dense rain, the friend of waters, and the quick traverser of the Vindhya mountains."
    }
  },
  {
    "id": "aditya-hridayam-14",
    "verse_number": 14,
    "original": "आतपी मण्डली मृत्युः पिङ्गलः सर्वतापनः। कविर्विश्वो महातेजा रक्तः सर्वभवोद्भवः॥",
    "transliteration": "ātapī maṇḍalī mṛtyuḥ piṅgalaḥ sarvatāpanaḥ। kavirviśvo mahātejā raktaḥ sarvabhavodbhavaḥ॥",
    "translations": {
      "english": "The intensely hot one, the orb, Death, Piṅgala (yellowish-brown), the scorcher of all, the Knower, the Universe, the greatly radiant one, the red one, the source of all existence."
    }
  },
  {
    "id": "aditya-hridayam-15",
    "verse_number": 15,
    "original": "नक्षत्रग्रहताराणामधिपो विश्वभावनः। तेजसामपि तेजस्वी द्वादशात्मन् नमोऽस्तु ते॥",
    "transliteration": "nakṣatragrahatārāṇāmadhipo viśvabhāvanaḥ। tejasāmapi tejasvī dvādaśātman namo'stu te॥",
    "translations": {
      "english": "The Lord of the constellations, planets, and stars, the creator of the universe, the light of even the lights. O Twelve-fold Self (Dvādaśātman), salutations to Thee!"
    }
  },
  {
    "id": "aditya-hridayam-16",
    "verse_number": 16,
    "original": "नमः पूर्वाय गिरये पश्चिमायाद्रये नमः। ज्योतिर्गणानां पतये दिनाधिपतये नमः॥",
    "transliteration": "namaḥ pūrvāya giraye paścimāyādraye namaḥ। jyotirgaṇānāṁ pataye dinādhipataye namaḥ॥",
    "translations": {
      "english": "Salutations to the eastern mountain (sunrise), salutations to the western mountain (sunset). Salutations to the Lord of stellar hosts, salutations to the Lord of the day."
    }
  },
  {
    "id": "aditya-hridayam-17",
    "verse_number": 17,
    "original": "जयाय जयभद्राय हर्यश्वाय नमो नमः। नमो नमः सहस्रांशो आदित्याय नमो नमः॥",
    "transliteration": "jayāya jayabhadrāya haryaśvāya namo namaḥ। namo namaḥ sahasrāṁśo ādityāya namo namaḥ॥",
    "translations": {
      "english": "Salutations, salutations to the giver of victory (Jaya), the auspicious victor (Jayabhadra), and the one with golden horses (Haryaśva). Salutations, salutations to the one with a thousand rays, salutations, salutations to Āditya."
    }
  },
  {
    "id": "aditya-hridayam-18",
    "verse_number": 18,
    "original": "नम उग्राय वीराय सारङ्गाय नमो नमः। नमः पद्मप्रबोधाय मार्ताण्डाय नमो नमः॥",
    "transliteration": "nama ugrāya vīrāya sāṅgarāya namo namaḥ। namaḥ padmaprabodhāya mārtāṇḍāya namo namaḥ॥",
    "translations": {
      "english": "Salutations to the fierce one (Ugra), the heroic one (Vīra), the one with a variegated body (Sāraṅga). Salutations, salutations to the enlightener of the lotus (Padmaprabodha), salutations, salutations to Mārtāṇḍa (the Sun)."
    }
  },
  {
    "id": "aditya-hridayam-19",
    "verse_number": 19,
    "original": "ब्रह्मेशानाच्युतेशाय सूराय तेजसे नमः। नमः विश्वप्रबोधाय मार्ताण्डाय नमो नमः॥",
    "transliteration": "brahmeśānācyuteśāya sūrāya tejase namaḥ। namaḥ viśvaprabodhāya mārtāṇḍāya namo namaḥ॥",
    "translations": {
      "english": "Salutations to the one whose form is Brahmā, Īśāna (Śiva), and Acyuta (Viṣṇu), to Sūra (Sun) and to his splendor. Salutations to the enlightener of the universe, salutations, salutations to Mārtāṇḍa."
    }
  },
  {
    "id": "aditya-hridayam-20",
    "verse_number": 20,
    "original": "तमसां भेदिने नमः हरये तेजसे नमः। इन्द्राय नमो नमः सर्वशत्रुविनाशिने॥",
    "transliteration": "tamasāṁ bhedine namaḥ haraye tejase namaḥ। indrāya namo namaḥ sarvaśatruvināśine॥",
    "translations": {
      "english": "Salutations to the dispeller of darkness, salutations to Hari (Viṣṇu) in the form of light. Salutations, salutations to Indra (the king of gods), the destroyer of all enemies."
    }
  },
  {
    "id": "aditya-hridayam-21",
    "verse_number": 21,
    "original": "आदित्यमुच्चार्य परं जपेत् पुरुषोत्तमम्। अनन्तरं त्रीन् जपेच्च नियम्य सुसमाहितः॥",
    "transliteration": "ādityamuccārya paraṁ japet puruṣottamam। anantaraṁ trīn japecca niyamya susamāhitaḥ॥",
    "translations": {
      "english": "After reciting 'Āditya' and meditating on the Supreme Being (Puruṣottama), one should silently repeat the following three verses with concentration."
    }
  },
  {
    "id": "aditya-hridayam-22",
    "verse_number": 22,
    "original": "अग्निहोत्रेषु चैवाहं हव्यं वाहं जगत्पतिः। अग्निं वहामि स च मेऽग्नौ जुहुतान्नमः॥",
    "transliteration": "agnihotreṣu caivāhaṁ havyaṁ vāhaṁ jagatpatiḥ। agniṁ vahāmi sa ca me'gnau juhutānnamah॥",
    "translations": {
      "english": "He (the Sun) is the supreme controller of the universe, bearing the oblations in the fire-sacrifices. He carries the fire, and in that fire, I offer my oblations to him. Salutations."
    }
  },
  {
    "id": "aditya-hridayam-23",
    "verse_number": 23,
    "original": "एष कृच्छ्रगतो राम रावणं त्वं हनिष्यसि। एतत् श्रुत्वा महाबाहो भवान् विजयी भविष्यसि॥",
    "transliteration": "eṣa kṛcchragato rāma rāvaṇaṁ tvaṁ haniṣyasi। etat śrutvā mahābāho bhavān vijayī bhaviṣyasi॥",
    "translations": {
      "english": "O Rāmā, when in difficulty, by chanting this, you shall kill Rāvaṇa. Hearing this, O mighty-armed one, you shall be victorious."
    }
  },
  {
    "id": "aditya-hridayam-24",
    "verse_number": 24,
    "original": "आदित्यं प्रेक्ष्य जप्त्वेदं परं हर्षमवाप्तवान्। धृत्वा च परमं तेजः रावणं प्रेक्ष्य दण्डवत्॥",
    "transliteration": "ādityaṁ prekṣya japtvedaṁ paraṁ harṣamavāptavān। dhṛtvā ca paramaṁ tejaḥ rāvaṇaṁ prekṣya daṇḍavat॥",
    "translations": {
      "english": "Looking at the Sun and reciting this, Rāmā attained supreme joy. Bearing great spiritual power, he looked at Rāvaṇa with determination."
    }
  },
  {
    "id": "aditya-hridayam-25",
    "verse_number": 25,
    "original": "रावणं प्रेक्ष्य हृष्टात्मा विजयं चिन्तयन् स्थितः। दण्डवत् प्रेक्ष्य हृष्टात्मा पुनश्चाचम्य राघवः॥",
    "transliteration": "rāvaṇaṁ prekṣya hṛṣṭātmā vijayaṁ cintayan sthitaḥ। daṇḍavat prekṣya hṛṣṭātmā punaścācamya rāghavaḥ॥",
    "translations": {
      "english": "Looking at Rāvaṇa, Rāmā, whose soul was delighted, stood thinking of victory. Raghava (Rāmā) looked at him with conviction, and purified himself again (with water)."
    }
  },
  {
    "id": "aditya-hridayam-26",
    "verse_number": 26,
    "original": "एतच्च्रुत्वा महातेजा नष्टशोकोऽभवत् तदा। धारयामास सञ्ज्ञात्वा राघवः प्रहसन्निव॥",
    "transliteration": "etacchrutvā mahātejā naṣṭaśoko'bhavat tadā। dhārayāmāsa sañjñātvā rāghavaḥ prahasanniva॥",
    "translations": {
      "english": "Hearing this (stotra), Rāmā, the greatly radiant one, became free from grief. Knowing the secret, Raghava held it (the stotra's power) and looked as if smiling."
    }
  },
  {
    "id": "aditya-hridayam-27",
    "verse_number": 27,
    "original": "अथ प्रहृष्टाङ्ग्लवाः पुनरुत्थाय वीर्यवान्। रावणं प्रेक्ष्य हृष्टात्मा युद्धाय समुपस्थितम्॥",
    "transliteration": "atha prahṛṣṭāṅglavāḥ punarutthāya vīryavān। rāvaṇaṁ prekṣya hṛṣṭātmā yuddhāya samupasthitam॥",
    "translations": {
      "english": "Then, with delighted limbs, the powerful one (Rāmā) rose again, looked at Rāvaṇa with a joyous heart, and prepared for battle."
    }
  },
  {
    "id": "aditya-hridayam-28",
    "verse_number": 28,
    "original": "रामेण दृष्ट्वा सम्प्राप्तमृगस्त्योऽथ जगाम ह। आगस्त्योऽथ ययौ क्षिप्रं यथागतं महातपाः॥",
    "transliteration": "rāmeṇa dṛṣṭvā samprāptamṛgastyo'tha jagāma ha। āgastyo'tha yayau kṣipraṁ yathāgataṁ mahātapāḥ॥",
    "translations": {
      "english": "When Rāmā had received the knowledge, Agastya (the sage) departed quickly, as he had come, the greatly ascetic one."
    }
  },
  {
    "id": "aditya-hridayam-29",
    "verse_number": 29,
    "original": "सर्वकर्माणि सिध्यन्ति जयं प्राप्नोति मानवः। जयं प्राप्नोति सर्वत्र तथा युद्धेषु राघवः॥",
    "transliteration": "sarvakarmāṇi sidhyanti jayaṁ prāpnoti mānavaḥ। jayaṁ prāpnoti sarvatra tathā yuddheṣu rāghavaḥ॥",
    "translations": {
      "english": "All actions of a man are accomplished, and he attains victory. Raghava (Rāmā) attained victory everywhere, especially in battles (by this Stotra)."
    }
  },
  {
    "id": "aditya-hridayam-30",
    "verse_number": 30,
    "original": "एतद् जप्त्वा महाबाहो रावणं त्वं हनिष्यसि। एतत् श्रुत्वा महाबाहो भवान् विजयी भविष्यसि॥",
    "transliteration": "etad japtvā mahābāho rāvaṇaṁ tvaṁ haniṣyasi। etat śrutvā mahābāho bhavān vijayī bhaviṣyasi॥",
    "translations": {
      "english": "By reciting this, O mighty-armed one, you shall kill Rāvaṇa. Hearing this, O mighty-armed one, you shall be victorious."
    }
  },
  {
    "id": "aditya-hridayam-31",
    "verse_number": 31,
    "original": "इत्येवं ब्रुवतो राम तव विजयं भविष्यति। आदित्यहृदयं नित्यं सर्वशत्रुविनाशनम्॥",
    "transliteration": "ityevaṁ bruvato rāma tava vijayaṁ bhaviṣyati। ādityahṛdayaṁ nityaṁ sarvaśatruvināśanam॥",
    "translations": {
      "english": "Thus spoken, O Rāmā, your victory will come. The Āditya Hṛdayam is eternal and the destroyer of all enemies."
    }
  }
]
    }
  ]
}
