
{
    "id": "lalita",
    "title": "Lalita Sahasranama",
    "author": "Sage Hayagrīva (narrated in Brahmanda Purana)",
    "introduction": "The Lalita Sahasranama is one of the most sacred texts in Shaktism, dedicated to the Hindu Mother Goddess Lalita Tripurasundari, the form of the Divine Mother (Shakti) who governs the three worlds. This hymn appears in the Uttara Khanda of the Brahmanda Purana and is presented as a conversation between the sage Agastya and Lord Hayagrīva (an incarnation of Vishnu).\n\nUnlike other Sahasranamas (thousand names) which may contain repetitive or manufactured names, the Lalita Sahasranama is unique because it is said to have been composed by the Goddess herself at the request of the Vāgdevatas (Goddesses of Speech), ensuring its flawless and supreme nature.\n\nRecitation of the Sahasranama is central to the worship of Lalita and is believed to grant spiritual merit, prosperity, and liberation (moksha). The names systematically describe the Goddess's physical attributes, her divine weapons (like the sugarcane bow and flowery arrows), her glorious pastimes, and her role as the ultimate creator, maintainer, and destroyer of the universe.",
    "chapters": [
        {
            "chapter_number": 1,
            "name": "Stotra (The Hymn of 1000 Names)",
            "audioUrl": "https://mdundo.com/song/4054527",  
            "summary": "The main devotional hymn containing the 1,000 epithets of Lalita Tripurasundari, as narrated by Hayagrīva. The names detail her divine form, actions, abode, and cosmic powers, forming the central core of her worship (Arcana). This section is traditionally followed by the Phalaśruti (results of recitation).",
            "verses_count": 190,
            "verses": [
                { "id": "lalita-1-1", "verse_number": 1, "original": "सिन्दूरारुणविग्रहां त्रिनयनां माणिक्यमौलि स्फुरत्\nतारानायक शेखरां स्मितमुखी मापीन वक्षोरुहाम्।\nपाणिभ्यामलिपूर्ण रत्न चषकं रक्तोत्पलं बिभ्रतीं\nसौम्यां रत्न घटस्थ रक्त चरणां ध्यायेत् पराम्बिकाम्॥", "transliteration": "sindūrāruṇavigrahāṁ trinayanāṁ māṇikyamouli sphurat\ntārānāyaka śekharāṁ smitamukhī māpīna vakṣōruhām.\npāṇibhyāmalipūrṇa ratna caṣakaṁ raktōtpalaṁ bibhratīṁ\nsaumyāṁ ratna ghaṭastha rakta caraṇāṁ dhyāyēt parāmbikām.", "translations": { "english": "We meditate upon the Supreme Mother, whose form is red like vermilion, who has three eyes, whose crown is adorned with glittering rubies and the moon (leader of stars), who has a smiling face and full breasts, who holds a jewel-filled cup of wine and a red lotus in her hands, who is gentle, and whose red feet are placed upon a jeweled pot." } },
                { "id": "lalita-1-2", "verse_number": 2, "original": "श्रीमाता श्रीमहाराज्ञी श्रीमत्सिंहासनेश्वरी ।\nचिदग्निकुण्डसम्भूता देवकार्यसमुद्यता ॥", "transliteration": "śrīmātā śrīmahārājñī śrīmatsimhāsaneśvarī |\ncidagnikuṇḍasambhūtā devakāryasamudyatā ||", "translations": { "english": "The Holy Mother (Śrīmātā), the Great Empress (Śrīmahārājñī), the Sovereign of the Auspicious Throne (Śrīmatsimhāsaneśvarī), who emerged from the fire pit of consciousness (Cidagnikuṇḍasambhūtā), and who is zealous in accomplishing the work of the Gods (Devakāryasamudyatā). (Names 1-4)" } },
                { "id": "lalita-1-3", "verse_number": 3, "original": "उद्यद्भानुसहस्राभा चतुर्बाहुसमन्विता ।\nरागस्वरूपपाशाढ्या क्रोधाकाराङ्कुशोज्ज्वला ॥", "transliteration": "udyadbhānusahasrābhā caturbāhusamantvitā |\nrāgasvarūpapāśāḍhyā krōdhākārāṅkuśōjjvalā ||", "translations": { "english": "She shines with the radiance of a thousand rising suns (Udyadbhānusahasrābhā), endowed with four arms (Caturbāhusamantvitā), holds the noose which is the form of attachment (Rāgasvarūpapāśāḍhyā), and shines with the goad which is the form of anger (Krōdhākārāṅkuśōjjvalā). (Names 5-8)" } },
                { "id": "lalita-1-4", "verse_number": 4, "original": "मनोरूपेक्षुकोदण्डा पञ्चतन्मात्रसायका ।\nनिजारुणप्रभापूरमज्जद्ब्रह्माण्डमण्डला ॥", "transliteration": "manōrūpēkṣukōdaṇḍā pañcatanmātrasāyakā |\nnijāruṇaprabhāpūramajjadbrahmāṇḍamaṇḍalā ||", "translations": { "english": "Her sugarcane bow is the form of the mind (Manōrūpēkṣukōdaṇḍā), her five arrows are the five subtle elements (Pañcatanmātrasāyakā), and the entire universe is immersed in the flood of her innate reddish radiance (Nijāruṇaprabhāpūramajjadbrahmāṇḍamaṇḍalā). (Names 9-11)" } },
                { "id": "lalita-1-5", "verse_number": 5, "original": "चम्पकाशोकपुन्नागसौगन्धिकलसत्कचा ।\nकुरुविन्दमणिश्रेणीकनत्कोटीर मण्डिता ॥", "transliteration": "campakāśōkapunnāgasaugandhikalatskacā |\nkuruvindamaṇiśrēṇīkanatkōṭīra maṇḍitā ||", "translations": { "english": "Her charming locks of hair carry the sweet fragrance of Campaka, Aśoka, and Punnāga flowers (Campakāśōkapunnāgasaugandhikalatskacā), and she is decorated with a crown sparkling with rows of Kuruvinda gems (Kuruvindamaṇiśrēṇīkanatkōṭīra maṇḍitā). (Names 12-14)" } },
                { "id": "lalita-1-6", "verse_number": 6, "original": "अष्टमीचन्द्रविभ्राजदलस्थलविराजिता ।\nमुखचन्द्रकलङ्काभमृगनाभिविशेषका ॥", "transliteration": "aṣṭamīcandra vibhrājadalasthalavirājitā |\nmukhacandrakalaṅkābhamṛganābhiviśēṣakā ||", "translations": { "english": "Her forehead is adorned with the luster of the crescent moon of the eighth lunar day (Aṣṭamīcandra vibhrājadalasthalavirājitā), and the mark (tilaka) of musk on her forehead resembles the spot on the moon (Mukhacandrakalaṅkābhamṛganābhiviśēṣakā). (Names 15-18)" } },
                { "id": "lalita-1-7", "verse_number": 7, "original": "शुद्धविद्यङ्कुराकारद्विजपङ्क्तिद्वयोज्ज्वला ।\nकर्पूरवीटिकासामोदपूरित दिङ्ञुखा ॥", "transliteration": "śuddhavidyaṅkurākāradvijapaṅktidvayōjjvalā |\nkarpūravīṭikāsāmōdapūrita diṅñukhā ||", "translations": { "english": "Her two rows of teeth shine like the sprout of Śuddha Vidya (Śuddhavidyaṅkurākāradvijapaṅktidvayōjjvalā), and the scent of the betel leaf (Karpūra Vīṭikā) she chews fills all the directions (Karpūravīṭikāsāmōdapūrita diṅñukhā). (Names 19-21)" } }
            ]
        }
    ]
}
