{
  "id": "mahishasura-mardini",
  "title": "Mahishasura Mardini Stotram",
  "author": "Ādi Śaṅkarācārya (Traditional Attribution)",
  "introduction": "The Mahishasura Mardini Stotram is a vibrant and powerful devotional hymn dedicated to Goddess Durgā, the destroyer of the buffalo-demon Mahiṣāsura. Composed in the style of a Garland of Praise, this stotram highlights the Goddess's fierce yet compassionate nature, her divine attributes, and her role as the supreme protectress of the cosmos. The verses are deeply rhythmic and are often chanted during the Navarātri festival to invoke the Goddess's blessings for victory over evil and obstacles.",
  "chapters": [
    {
      "chapter_number": 1,
      "name": "Hymn to the Destroyer of Mahisha",
      "summary": "This chapter comprises the entire stotram, praising Goddess Durgā through a series of vivid descriptions of her battles, her ornaments, her celestial presence, and her role as the ultimate source of knowledge and fortune. It concludes with the traditional Phalaśruti, outlining the benefits of recitation.",
      "verses_count": 22,
      "verses": [
        {
          "id": "mmm-1-1",
          "verse_number": 1,
          "original": "अयि गिरिनन्दिनि नन्दितमेदिनि विश्वविनोदिनि नन्दिनुते। गिरिवरविन्ध्यशिरोधिनिवासिनि विष्णुविलासिनि जिष्णुनुते। भगवति हे शितिकण्ठकुटुम्बिनि भूरिकुटुम्बिनि भूरि कृते। जय जय हे महिषासुरमर्दिनि रम्यकपर्दिनि शैलसुते॥",
          "transliteration": "ayi girinandini nanditamedini viśvavinodini nandinute। girivaravindhyaśirodhinivāsini viṣṇuvilāsini jiṣṇunute। bhagavati he śitikaṇṭhakuṭumbini bhūrikuṭumbini bhūri kṛte। jaya jaya he mahiṣāsuramardhini ramyakapardhini śailasute॥",
          "translations": {
            "english": "O Daughter of the Mountain (Himālaya), who brings joy to the whole earth, who delights the universe, praised by Nandi (Shiva's bull). O Dweller on the peaks of the great Vindhya mountain, partner of Vishnu, praised by the Victorious (Indra). O Goddess, Consort of the blue-throated one (Shiva), having countless families, you who perform great deeds. Victory, victory to you, O Destroyer of Mahishasura, with the beautiful braided hair, O Daughter of the Mountain."
          }
        },
        {
          "id": "mmm-1-2",
          "verse_number": 2,
          "original": "सुरवरवर्षिणि दुर्धरधर्षिणि दुर्मुखमर्षिणि हर्षरते। त्रिभुवनपोषिणि शङ्करतोषिणि किल्बिषमोषिणि घोषरते। दनुजनिरोषिणि दितिसुतरोषिणि दुर्मदशोषिणि सिन्धुसुते। जय जय हे महिषासुरमर्दिनि रम्यकपर्दिनि शैलसुते॥",
          "transliteration": "suravaravarṣiṇi durdharadharṣiṇi durmukhamarṣiṇi harṣarate। tribhuvanapoṣiṇi śaṅkaratoṣiṇi kilbiṣamoṣiṇi ghoṣarate। danujanirōṣiṇi ditisutarōṣiṇi durmadaśōṣiṇi sindhusute। jaya jaya he mahiṣāsuramardhini ramyakapardhini śailasute॥",
          "translations": {
            "english": "O showerer of boons on the gods, who defeats the invincible, who tolerates the foul-mouthed, who delights in joy. O nourisher of the three worlds, who pleases Shankara, who removes sins, who rejoices in sound (music). O angry one against the Danavas, O wrathful one against the sons of Diti, who dries up evil pride, O Daughter of the Ocean (Lakshmi's form). Victory, victory to you, O Destroyer of Mahishasura, with the beautiful braided hair, O Daughter of the Mountain."
          }
        },
        {
          "id": "mmm-1-3",
          "verse_number": 3,
          "original": "अयि शतखण्डविखण्डितरुण्ड वितुण्डितशुण्ड गजाधिपते। रिपुगजगण्डविदारणचण्ड पराक्रमशुण्ड मृगाधिपते। निजभुजदण्डनिपातितखण्ड विपाटितमुण्ड भटाधिपते। जय जय हे महिषासुरमर्दिनि रम्यकपर्दिनि शैलसुते॥",
          "transliteration": "ayi śatakhaṇḍavikhaṇḍitaruṇḍ vituṇḍitaśuṇḍa gajādhipate। ripugajagaṇḍavidāraṇacaṇḍa parākramaśuṇḍa mṛgādhipate। nijabhujadaṇḍanipātitakhaṇḍa vipāṭitamuṇḍa bhaṭādhipate। jaya jaya he mahiṣāsuramardhini ramyakapardhini śailasute॥",
          "translations": {
            "english": "O Goddess, who breaks the heads of the great elephant-demons into a hundred pieces, and whose mighty Lion tears apart the temples of the enemy-elephants with fierce valor. O Goddess, whose own mighty arms strike down the enemy armies, breaking and splitting their heads. Victory, victory to you, O Destroyer of Mahishasura, with the beautiful braided hair, O Daughter of the Mountain."
          }
        },
        {
          "id": "mmm-1-4",
          "verse_number": 4,
          "original": "अयि रणदुर्मद शत्रुवधोदित दुर्धरनिर्जर शक्तिभृते। चतुरविचारधुरीण महाशिव दूतकृत प्रमथाधिपते। दुरितदुरीहदुराशयदुर्मद दानवदूत कृतान्तमते। जय जय हे महिषासुरमर्दिनि रम्यकपर्दिनि शैलसुते॥",
          "transliteration": "ayi raṇadurmada śatruvadhōdita durdharanirjara śaktibhṛte। caturavicāradhurīṇa mahāśiva dūtakṛta pramatādhipate। duritadurīhadurāśayadurmada dānavadūta kṛtāntamate। jaya jaya he mahiṣāsuramardhini ramyakapardhini śailasute॥",
          "translations": {
            "english": "O Goddess, who possesses the invincible power of the gods to kill the war-mad enemies. O Chief of the Pramatha Ganas (of Shiva), for whom the wise and great Shiva acts as a messenger. O one whose judgment brings death to the wicked, evil, evil-minded, and arrogant messengers of the Danavas. Victory, victory to you, O Destroyer of Mahishasura, with the beautiful braided hair, O Daughter of the Mountain."
          }
        },
        {
          "id": "mmm-1-5",
          "verse_number": 5,
          "original": "अयि शरणागत वैरिवधूवर वीरवराभय दायकरे। त्रिभुवनमस्तक शूलविरोधि शिरोऽधिकृ तां मलबद्धकरे। दुमिदुमितामर दुन्दुभिनाद महोमुखरीकृ त तिग्मकरे। जय जय हे महिषासुरमर्दिनि रम्यकपर्दिनि शैलसुते॥",
          "transliteration": "ayi śaraṇāgata vairivadhūvara vīravarābhaya dāyakare। tribhuvanamastaka śūlavirōdhi śirō’dhikṛtāṁ malabaddhakare। dumidumitāmara dundubhināda mahōmukharīkṛta tigmākare। jaya jaya he mahiṣāsuramardhini ramyakapardhini śailasute॥",
          "translations": {
            "english": "O Giver of refuge to the best of heroes, even to the wives of the enemies who seek shelter. O one who holds a mace (or sword) to counter the pain (śūla) on the heads of the three worlds. O one whose sharp hands are heralded by the thunderous 'dum-dum' sound of the drums of the gods. Victory, victory to you, O Destroyer of Mahishasura, with the beautiful braided hair, O Daughter of the Mountain."
          }
        },
        {
          "id": "mmm-1-6",
          "verse_number": 6,
          "original": "अयि निजहुङ्कृतिममात्रनिराकृ त धूम्रविलोचन धूम्रशते। समरविशोषित शोणितबीज समुद्भवशोणित बीज लते। शिवशिवशुम्भनिशुम्भमहाहव तर्पितभूत पिशाचरते। जय जय हे महिषासुरमर्दिनि रम्यकपर्दिनि शैलसुते॥",
          "transliteration": "ayi nijahuṅkṛtimātranirākṛta dhūmravilōcana dhūmraśate। samaraviśōṣita śōṇitabīja samudbhavaśōṇita bīja late। śivaśivaśumbhaniśumbhamahāhava tarpitabhūta piśācarate। jaya jaya he mahiṣāsuramardhini ramyakapardhini śailasute॥",
          "translations": {
            "english": "O Goddess, who by a mere roar (Huṅkṛti) repelled hundreds of Dhumralochanas (smoke-eyed demons). O vine that grew blood-red from the blood of the seed-demon (Raktābīja) dried up in battle. O one who delights the Bhūtas and Piśāchas (goblins) who are satisfied by the great war with Shumbha and Nishumbha. Victory, victory to you, O Destroyer of Mahishasura, with the beautiful braided hair, O Daughter of the Mountain."
          }
        },
        {
          "id": "mmm-1-7",
          "verse_number": 7,
          "original": "अयि सुरललना ततथेयित थेयित थाभिनया नृत्यरते। कृ तकु कु थ कु कु थो गददिद्धट दुद्धट झल्लरि वाद्यरते। रमितसुनाट कपूर्वर तिप्रमदाकुल नृत्यकरप्रमते। जय जय हे महिषासुरमर्दिनि रम्यकपर्दिनि शैलसुते॥",
          "transliteration": "ayi suralalanā tatatheyita theyita thābhinayā nṛtyarate। kṛtakukutha kukutho gadadiddhaṭa dudhdhaṭa jhallari vādyarate। ramitasunāṭakapūrvapramadākulanṛtyakarapramate। jaya jaya he mahiṣāsuramardhini ramyakapardhini śailasute॥",
          "translations": {
            "english": "O one who delights in the dance of the celestial damsels (Sura-lalanā) with the rhythmic steps of 'Tatatheyita, theyita, tha.' O one who delights in the music of the cymbals (Jhallarī) played to the rhythm of 'Kukutha, kukutho, gadadiddhaṭa, dudhdhaṭa.' O one whose beautiful dance is preceded by the intense joy of all the devotees. Victory, victory to you, O Destroyer of Mahishasura, with the beautiful braided hair, O Daughter of the Mountain."
          }
        },
        {
          "id": "mmm-1-8",
          "verse_number": 8,
          "original": "अयि सुमनःसुमनःसुमनः सुमनःसुमनोहरकान्तियुते। श्रितरजनीरजनीरजनी रजनीकरवक्त्रवृते। सुनयनविभ्रमरभ्रमर भ्रमरभ्रमराधिपते। जय जय हे महिषासुरमर्दिनि रम्यकपर्दिनि शैलसुते॥",
          "transliteration": "ayi sumanaḥsumanaḥsumanaḥ sumanaḥsumanōharakāntiyute। śritarajanīrajanīrajanī rajanīkaravaktravṛte। sunayanavibhramarabhramarabhramarabhramarādhipate। jaya jaya he mahiṣāsuramardhini ramyakapardhini śailasute॥",
          "translations": {
            "english": "O Goddess, who is adorned with flowers (sumanaḥ), who has a pleasant and charming splendor. O one whose moon-like face dispels the darkness of the night (rajanī). O one whose beautiful eyes resemble the wandering bee (bhramara) and who is the chief of the bees (alluding to the attraction of the devotees). Victory, victory to you, O Destroyer of Mahishasura, with the beautiful braided hair, O Daughter of the Mountain."
          }
        },
        {
          "id": "mmm-1-9",
          "verse_number": 9,
          "original": "महति महाहव मल्लमतल्लिक सल्लित मल्लक रल्लकते। विरचितवल्लिक भल्लिक मिल्लिक झिल्लिक भिल्लिक वर्ग वृते। सितकृत पुल्लिस मुल्लिसितारुण तल्लज पल्लव सल्ललिते। जय जय हे महिषासुरमर्दिनि रम्यकपर्दिनि शैलसुते॥",
          "transliteration": "mahati mahāhava mallamatallika sallita mallaka rallakate। viracitavallika bhallika millika jhillika bhillika vargavrute। sitakṛtapullisamullasitāruṇ tallajapallavasallalite। jaya jaya he mahiṣāsuramardhini ramyakapardhini śailasute॥",
          "translations": {
            "english": "O Goddess, who fought the fierce battle against the great, magnificent wrestlers (demons), who is surrounded by a group of warriors wielding spears (bhallika), bows (jhillika), and other weapons. O beautiful one, adorned with white lotuses and the radiant glow of reddish-colored, fresh sprouts. Victory, victory to you, O Destroyer of Mahishasura, with the beautiful braided hair, O Daughter of the Mountain."
          }
        },
        {
          "id": "mmm-1-10",
          "verse_number": 10,
          "original": "अयि विचितिन्त्र मयूखतिरस्कृत कुक्कुट पित्त मयूखवते। ऊरिमहाविवरध्वनिघोर महाहव मुखरित दिङ्मुखते। जयरथसिन्धुरकुञ्जर गर्जित वीरनिशार्जर गर्जितते। जय जय हे महिषासुरमर्दिनि रम्यकपर्दिनि शैलसुते॥",
          "transliteration": "ayi vicitintramayūkhatiraskṛta kukkuṭapittamayūkhavate। ūrimahāvivaradhvanighōra mahāhava mukharita diṅmukhate। jayarathasindhurakuñjara garjita vīraniśārjara garjitate। jaya jaya he mahiṣāsuramardhini ramyakapardhini śailasute॥",
          "translations": {
            "english": "O Goddess, whose multicolored rays surpass the shining feathers of the peacock. O one whose terrible roar in the great war fills the directions, sounding like the blast from a deep abyss. O one whose roar is like the trumpeting of the victorious war elephants and the roaring of the heroic lions. Victory, victory to you, O Destroyer of Mahishasura, with the beautiful braided hair, O Daughter of the Mountain."
          }
        },
        {
          "id": "mmm-1-11",
          "verse_number": 11,
          "original": "रणमदपूर्ण कृ पातकशूर भरितसुरोत्तम खड्ग धृते। दुरुद्धरनिर्जर दितिसुतदर्प विदारित दुर्धर दुर्म्मदते। सुरललना कृतततथय गान नृत्यरते कृत कञ्जर वक्त्रकृते। जय जय हे महिषासुरमर्दिनि रम्यकपर्दिनि शैलसुते॥",
          "transliteration": "raṇamadapūrṇa kṛpātakeśūra bharitasurōttama khaḍgadhṛte। duruddharanirjara ditisutadarpa vidārita durdharadurmadate। suralalanākṛtatathayagāna nṛtyarate kṛtakañjaravakṭrakṛte। jaya jaya he mahiṣāsuramardhini ramyakapardhini śailasute॥",
          "translations": {
            "english": "O valiant one, filled with the madness of battle, holding the sword of the best of gods. O one who destroys the invincible, arrogant pride of the sons of Diti (Asuras). O one who delights in the song and dance of the celestial women, and whose face is like the best of elephants. Victory, victory to you, O Destroyer of Mahishasura, with the beautiful braided hair, O Daughter of the Mountain."
          }
        },
        {
          "id": "mmm-1-12",
          "verse_number": 12,
          "original": "अयि कमलाललितामल भाल तमाल नवालिक तल्ललते। त्रिनयनमण्डल मौलिमिलत्कर कान्ति कलिच्छट दण्डलते। असितभुजङ्गम हारधर प्रवरार्पित सुन्दर कान्तिलते। जय जय हे महिषासुरमर्दिनि रम्यकपर्दिनि शैलसुते॥",
          "transliteration": "ayi kamalālalitāmala bhāla tamāla navālikatallalate। trinayanamantala maulimilakara kāntikalicchaṭadantalate। asitabhujangamahāradhara pravarārpita sundarakāntilate। jaya jaya he mahiṣāsuramardhini ramyakapardhini śailasute॥",
          "translations": {
            "english": "O beautiful one, whose pure forehead shines like a Tamāla tree leaf adorned by a new shoot. O one whose body shines with the rays emanating from the moon resting on the head of the three-eyed one (Shiva). O one whose beautiful form is adorned with garlands of black snakes (like Shiva). Victory, victory to you, O Destroyer of Mahishasura, with the beautiful braided hair, O Daughter of the Mountain."
          }
        },
        {
          "id": "mmm-1-13",
          "verse_number": 13,
          "original": "कमलदलच्छवि सुन्दरभाल कु न्तलकु वलय कु ण्डलते। सुरकरमौलिमना ललनाधिक भालललाम मनोहृदये। जय जय हे महिषासुरमर्दिनि रम्यकपर्दिनि शैलसुते॥",
          "transliteration": "kamaladalacchavi sundarabhālakuntalakūvalayakunḍalate। surakaramōlimanā lalanādhika bhālalalāma manōhṛdaye। jaya jaya he mahiṣāsuramardhini ramyakapardhini śailasute॥",
          "translations": {
            "english": "O one whose forehead, beautiful like lotus petals, has dark curly hair, and whose earrings are like blue water lilies. O one whose forehead is adorned by the mind of a woman (Pārvatī) who is superior to the celestial women, and who is dear to the hearts of the gods. Victory, victory to you, O Destroyer of Mahishasura, with the beautiful braided hair, O Daughter of the Mountain."
          }
        },
        {
          "id": "mmm-1-14",
          "verse_number": 14,
          "original": "कनकपिशङ्ग पृ षत्कनिषङ्ग रसद्भटशृङ्ग हताबटुके। कृ तचतुरङ्ग बलक्षितिरङ्ग घटद्बहरङ्ग रटद्बटुके। जय जय हे महिषासुरमर्दिनि रम्यकपर्दिनि शैलसुते॥",
          "transliteration": "kanakapiśaṅga pṛṣatkaniṣanga rasadbhaṭaśṛṅga hatābaṭuke। kṛtacaturaṅga balakṣitiraṅga ghaṭadbāhuraṅga raṭadbāṭuke। jaya jaya he mahiṣāsuramardhini ramyakapardhini śailasute॥",
          "translations": {
            "english": "O one whose quiver is golden-yellow, whose heroic bow twangs as it kills the enemy soldiers. O one who turns the battlefield into a stage where the four divisions of the army clash with the sound of the chanting hordes. Victory, victory to you, O Destroyer of Mahishasura, with the beautiful braided hair, O Daughter of the Mountain."
          }
        },
        {
          "id": "mmm-1-15",
          "verse_number": 15,
          "original": "सुरतनिषङ्ग भृ तभुजसङ्ग चलच्चरणोरु तरङ्ग गते। कृतकदनोद्धत दण्डनिपातित शूलशूलि हतासुरते। कृ तबहुलाम्बुविलासिनि शैलसभाजन मोदित मञ्जुलते। जय जय हे महिषासुरमर्दिनि रम्यकपर्दिनि शैलसुते॥",
          "transliteration": "surataniṣaṅga bhṛtabhujasaṅga calaccaraṇōrutaraṅgagate। kṛtakadanōddhata dantadanḍanipātita śūlaśūlihatāsurate। kṛtabahulāmbuvilāsini śailasabhājanamōditamañjulate। jaya jaya he mahiṣāsuramardhini ramyakapardhini śailasute॥",
          "translations": {
            "english": "O one whose hands bear the various divine weapons, whose swift steps move like powerful waves. O one who fiercely destroys the Asuras by striking them with the trident (śūla). O one who, delighting in playing in the waters, is praised and delighted by the mountain assembly (Shiva’s Ganas). Victory, victory to you, O Destroyer of Mahishasura, with the beautiful braided hair, O Daughter of the Mountain."
          }
        },
        {
          "id": "mmm-1-16",
          "verse_number": 16,
          "original": "अयि विबुधालय मोदिततालिल लालितकुन्तल कु ञ्जकृते। कृत सुतलालित पल्लवलिङ्गित कोमल मञ्जुल गुञ्जकृते। जय जय हे महिषासुरमर्दिनि रम्यकपर्दिनि शैलसुते॥",
          "transliteration": "ayi vibudhālayamōditatālilalālitakuntalakunjakṛte। kṛtasutalālitapallavalingitakōmalamanjulagunjakṛte। jaya jaya he mahiṣāsuramardhini ramyakapardhini śailasute॥",
          "translations": {
            "english": "O Goddess, whose hair is adorned with beautiful blossoms, and who delights in the sweet humming sound (guñja) of the tender sprouts kissed by her sons. Victory, victory to you, O Destroyer of Mahishasura, with the beautiful braided hair, O Daughter of the Mountain."
          }
        },
        {
          "id": "mmm-1-17",
          "verse_number": 17,
          "original": "कमलदलच्छवि सुन्दरभाल कु न्दलितालिका कु ण्डलते। सुरकरमौलिमना ललिता ललनाधिक भालललाम मनोहृदये। जय जय हे महिषासुरमर्दिनि रम्यकपर्दिनि शैलसुते॥",
          "transliteration": "kamaladalacchavi sundarabhālakundalitālikākunḍalate। surakaramōlimanā lalitā lalanādhika bhālalalāma manōhṛdaye। jaya jaya he mahiṣāsuramardhini ramyakapardhini śailasute॥",
          "translations": {
            "english": "O one whose beautiful forehead shines like a lotus petal, with curly locks and earrings. O one who is the supreme focus of the minds of the gods, whose beautiful form is enshrined in the hearts of all women. Victory, victory to you, O Destroyer of Mahishasura, with the beautiful braided hair, O Daughter of the Mountain."
          }
        },
        {
          "id": "mmm-1-18",
          "verse_number": 18,
          "original": "गिरिसुतनन्दिनि विश्वविनोदिनि नन्दिनुते गिरिवरविन्ध्यशिरोधिनि वासिनि विष्णुविलासिनि जिष्णुनुते। भगवति हे शितिकण्ठकुटुम्बिनि भूरिकुटुम्बिनि भूरि कृते। जय जय हे महिषासुरमर्दिनि रम्यकपर्दिनि शैलसुते॥",
          "transliteration": "girisutanandini viśvavinodini nandinute girivaravindhyaśirōdhini vāsini viṣṇuvilāsini jiṣṇunute। bhagavati he śitikaṇṭhakuṭumbini bhūrikuṭumbini bhūri kṛte। jaya jaya he mahiṣāsuramardhini ramyakapardhini śailasute॥",
          "translations": {
            "english": "(Repeat of Verse 1, emphasizing her essential nature) O Daughter of the Mountain, who delights the universe, praised by Nandi, Dweller on the peaks of the great Vindhya mountain, partner of Vishnu, praised by the Victorious (Indra). O Goddess, Consort of the blue-throated one (Shiva), having countless families, you who perform great deeds. Victory, victory to you, O Destroyer of Mahishasura, with the beautiful braided hair, O Daughter of the Mountain."
          }
        },
        {
          "id": "mmm-1-19",
          "verse_number": 19,
          "original": "अयि मयि दीनदयालु तयेप कृ पा न केवलमयि क्रियताम्। अयि निजदेहविलोलकलितं द्रुमं कुरु मा कृत संचित कम्। अयि निजदृ ष्टि निरीक्षितमात्र स एव दिङ्मुखि शान्तिकृतम्। जय जय हे महिषासुरमर्दिनि रम्यकपर्दिनि शैलसुते॥",
          "transliteration": "ayi mayi dīnadyālutayēpa kṛpā na kēvalamayi kriyatām। ayi nijadēhavilōlakalitam drumaṁ kuru mā kṛta saṁcitakam। ayi nijadṛṣṭinirīkṣitamātra sa ēva diṅmukhi śāntikṛtam। jaya jaya he mahiṣāsuramardhini ramyakapardhini śailasute॥",
          "translations": {
            "english": "O Goddess, show me compassion out of pity for the distressed, not just out of tradition. O one whose mere glance brings peace in all directions. Victory, victory to you, O Destroyer of Mahishasura, with the beautiful braided hair, O Daughter of the Mountain."
          }
        },
        {
          "id": "mmm-1-20",
          "verse_number": 20,
          "original": "अयि सुमुखेन्दुमरीचिरुचीकृत चन्द्रकलाधृत मौलिगणम्। अयि विबुधालयमङ्गलकेलित चित्तकृ पाकटि वक्रतटम्। जय जय हे महिषासुरमर्दिनि रम्यकपर्दिनि शैलसुते॥",
          "transliteration": "ayi sumukhēndumarīcirucīkṛta candrakalādhṛta mauligaṇam। ayi vibudhālayamangalakēlita cittakṛpākaṭi vakrataṭam। jaya jaya he mahiṣāsuramardhini ramyakapardhini śailasute॥",
          "translations": {
            "english": "O Goddess, whose crown is adorned with the crescent moon made radiant by the rays of her beautiful moon-like face. O one whose merciful sidelong glance is the auspicious play in the abodes of the gods. Victory, victory to you, O Destroyer of Mahishasura, with the beautiful braided hair, O Daughter of the Mountain."
          }
        },
        {
          "id": "mmm-1-21",
          "verse_number": 21,
          "original": "अयि कमले कमला निलये कमला निलये कमलारुचिते। कमले कमला निलये कमला निलये नमतां नमतां नमताम्। जय जय हे महिषासुरमर्दिनि रम्यकपर्दिनि शैलसुते॥",
          "transliteration": "ayi kamale kamalānilaye kamalānilaye kamalārucitē। kamale kamalānilaye kamalānilaye namatāṁ namatāṁ namatām। jaya jaya he mahiṣāsuramardhini ramyakapardhini śailasute॥",
          "translations": {
            "english": "O Goddess, who is the Lotus (Kamalā), who is the Dwelling of the Lotus (Kamalānilaya), O one who delights the Lotus (Kamalā), O Lotus, O Dwelling of the Lotus, O one who bows to those who bow, bows to those who bow, bows to those who bow (to her). Victory, victory to you, O Destroyer of Mahishasura, with the beautiful braided hair, O Daughter of the Mountain."
          }
        },
        {
          "id": "mmm-1-22",
          "verse_number": 22,
          "original": "फलश्रुतिः – इदं स्तॊत्रं पठेन्नित्यं भक्या संस्तुत्य ताम्बिकां। सन्ततिं श्रियं भोगान् स्वर्गं मोक्षं च विन्दति॥",
          "transliteration": "phalaśrutiḥ – idaṁ stōtraṁ paṭhēnnityaṁ bhaktyā saṁstutya tāmbikāṁ। santatiṁ śriyaṁ bhōgān swargaṁ mōkṣaṁ ca vindati॥",
          "translations": {
            "english": "(Phalaśruti - Result of listening) The one who recites this hymn daily with devotion, praising that Ambikā (Mother), attains progeny, wealth, enjoyment, heaven, and liberation."
          }
        }
      ]
    }
  ]
}
