{
  "id": "rudrashtakam-tulsidas",
  "title": "Rudrashtakam (Octet in Praise of Rudra/Shiva)",
  "author": "Goswami Tulsidas",
  "audioUrl":"https://www.youtube.com/watch?v=pI202yQMIXw&list=RDpI202yQMIXw&start_radio=1",
  "introduction": "The Rudrashtakam is a famous Sanskrit devotional hymn (stotra) composed by Goswami Tulsidas, the author of the Ramcharitmanas. It is dedicated to Lord Shiva, who is addressed here as Rudra. The hymn is known for its beautiful descriptions of Shiva's form and qualities, and is often recited to seek protection, purity of mind, and liberation. It consists of eight main verses (shlokas) and a concluding verse (phala shruti)."
  "chapters": [
    {
      "chapter_number": 1,
      "name": "Stuti (Praise)",
      "verses_count": 8,
      "verses": [
        {
          "id": "rudrashtakam-1-1",
          "verse_number": 1,
          "original": "नमामीशमीशान निर्वाणरूपं\nविभुं व्यापकं ब्रह्म वेदस्वरूपम्।\nनिजं निर्गुणं निर्विकल्पं निरीहं\nचिदाकाशमाकाशवासं भजेऽहम्॥",
          "transliteration": "namāmīśamīśāna nirvāṇarūpaṁ\nvibhuṁ vyāpakaṁ brahma vēdasvarūpam |\nnijaṁ nirguṇaṁ nirvikampaṁ nirīhaṁ\ncidākāśamākāśavāsaṁ bhajē'ham ||",
          "translations": {
            "english": "I bow to the Lord (Īśam), the ruler (Īśāna), whose form is liberation (Nirvāṇarūpam). He is pervasive (Vibhum), all-encompassing (Vyāpakam), the Brahman, whose essence is the Vedas (Vēdasvarūpam). He is the eternal Self (Nijam), without attributes (Nirguṇam), free from change (Nirvikalpaṁ), and desireless (Nirīham). I worship Him, the consciousness-space (Cidākāśam), who resides in the sky (Ākāśavāsam)."
          }
        },
        {
          "id": "rudrashtakam-1-2",
          "verse_number": 2,
          "original": "निराकारमोङ्कारमूलं तुरीयं\nगिरा ज्ञान गोतीतमीशं गिरीशम्।\nकरालं महाकाल कालं कृपालं\nगुणागार संसारपारं नतोऽहम्॥",
          "transliteration": "nirākāramōṅkāramūlaṁ turīyaṁ\ngirā jñāna gōtītamīśaṁ girīśam |\nkarālaṁ mahākāla kālaṁ kṛpālaṁ\nguṇāgāra saṁsārapāraṁ natō'ham ||",
          "translations": {
            "english": "I bow to Him who is formless (Nirākāram), the root of Om (Oṁkāramūlam), the fourth state of consciousness (Turīyam). He is the Lord (Īśam) and Lord of the mountains (Girīśam), transcending speech, knowledge, and senses (Girā Jñāna Gōtītam). He is dreadful (Karālaṁ) and the Death of the great time (Mahākāla Kālam), yet merciful (Kṛpālam). The abode of all virtues (Guṇāgāra), who leads across Saṁsāra (Saṁsārapāram)."
          }
        },
        {
          "id": "rudrashtakam-1-3",
          "verse_number": 3,
          "original": "तुषाराद्रि सङ्काश गौरं गभीरं\nमनोभूत कोटि प्रभा श्री शरीरम्।\nस्फुरन् मौलि कल्लोलिनी चारु गङ्गा\nलसद् भाल बालेन्दु कण्ठे भुजङ्गा॥",
          "transliteration": "tuṣārādri saṅkāśa gauraṁ gabhīraṁ\nmanōbhūta kōṭi prabhā śrī śarīram |\nsphuran mauli kallōlinī cāru gaṅgā\nlasad bhāla bālēndu kaṇṭhē bhujaṅgā ||",
          "translations": {
            "english": "His complexion is white (Gauram) like a heap of snow (Tuṣārādri Saṅkāśa), and He is profound (Gabhīraṁ). His divine body (Śrī Śarīram) possesses the brilliance of millions of Cupids (Manōbhūta Kōṭi Prabhā). The beautiful Gaṅgā, the river (Kallōlinī Cāru Gaṅgā), shines on His head (Sphuran Mauli). His forehead is graced by the crescent moon (Lasad Bhāla Bālēndu), and around His neck are serpents (Kaṇṭhē Bhujaṅgā)."
          }
        },
        {
          "id": "rudrashtakam-1-4",
          "verse_number": 4,
          "original": "चलत् कुण्डल भ्रू सुनेत्रं विशालं\nप्रसन्नाननं नीलकण्ठं दयालम्।\nमृगाधीश चर्माम्बरं मुण्डमालं\nप्रियं शङ्करं सर्वनाथं भजामि॥",
          "transliteration": "calat kuṇḍala bhrū sunētraṁ viśālaṁ\nprasannānanaṁ nīlakaṇṭhaṁ dayālam |\nmṛgādhīśa carmāmbaraṁ muṇḍamālaṁ\npriyaṁ śaṅkaraṁ sarvanāthaṁ bhajāmi ||",
          "translations": {
            "english": "I worship the beloved Śaṅkara, the Lord of all (Sarvanātham). His eyes are beautiful and large (Su Nētraṁ Viśālam), with moving earrings (Calat Kuṇḍala) and captivating eyebrows (Bhrū). He has a cheerful face (Prasannānanaṁ), a blue throat (Nīlakaṇṭhaṁ), and is compassionate (Dayālam). He wears the hide of an elephant/lion (Mṛgādhīśa Carmāmbaraṁ) and a garland of skulls (Muṇḍamālaṁ)."
          }
        },
        {
          "id": "rudrashtakam-1-5",
          "verse_number": 5,
          "original": "प्रचण्डं प्रकृष्टं प्रगल्भं परेशं\nअखण्डं अजं भानु कोटि प्रकाशम्।\nत्रयः शूल निर्मूलनं शूलपाणिं\nभजेऽहं भवानीपतिं भावगम्यम्॥",
          "transliteration": "pracaṇḍaṁ prakṛṣṭaṁ pragalbhaṁ parēśaṁ\nakhaṇḍaṁ ajaṁ bhānu kōṭi prakāśam |\ntrayah śūla nirmūlanaṁ śūlapāṇiṁ\nbhajē'haṁ bhavānīpatiṁ bhāvagamyam ||",
          "translations": {
            "english": "I worship Bhāvanī’s consort (Bhavānīpatiṁ), who is attained through pure feeling (Bhāvagamyam). He is tremendous (Pracaṇḍaṁ), excellent (Prakṛṣṭaṁ), valiant (Pragalbhaṁ), and the Supreme Lord (Parēśaṁ). He is indivisible (Akhaṇḍaṁ), unborn (Ajaṁ), and shines with the brilliance of millions of suns (Bhānu Kōṭi Prakāśam). He holds the trident (Śūlapāṇiṁ) and eradicates the three types of suffering (Trayah Śūla Nirmūlanam)."
          }
        },
        {
          "id": "rudrashtakam-1-6",
          "verse_number": 6,
          "original": "कलातीत कल्याण कल्पान्तकारी\nसदा सज्जनानन्द दाता पुरारी।\nचिदानन्द सन्दोह मोहापहारी\nप्रसीद प्रसीद प्रभो मन्मथारी॥",
          "transliteration": "kalātīta kalyāṇa kalpāntakārī\nsadā sajjanānanda dātā purārī |\ncidānanda sandōha mōhāpahārī\nprasīda prasīda prabhō manmathārī ||",
          "translations": {
            "english": "O Lord, the enemy of Cupid (Manmathārī)! Be pleased, be pleased (Prasīda)! You are beyond the arts (Kalātīta), auspicious (Kalyāṇa), the destroyer at the end of the Kalpa (Kalpāntakārī). You are always the giver of joy to the virtuous (Sadā Sajjanānanda Dātā), the destroyer of the three cities (Purārī). You are an abundance of consciousness and bliss (Cidānanda Sandōha), and the remover of delusion (Mōhāpahārī)."
          }
        },
        {
          "id": "rudrashtakam-1-7",
          "verse_number": 7,
          "original": "न यावद् उमानाथ पादारविन्दं\nभजन्तीह लोके परे वा नराणाम्।\nन तावत् सुखं शान्ति सन्ताप नाशं\nप्रसीद प्रभो सर्वभूताधिवासम्॥",
          "transliteration": "na yāvad umānātha pādāravindaṁ\nbhajantīha lōkē parē vā narāṇām |\nna tāvat sukhaṁ śānti santāpa nāśaṁ\nprasīda prabhō sarvabhūtādhivāsam ||",
          "translations": {
            "english": "O Lord, the indweller of all beings (Sarvabhūtādhivāsam)! Be pleased! As long as people, either in this world or the next, do not worship the lotus feet of Umā’s Lord (Umānātha Pādāravindaṁ), they cannot attain happiness, peace, or the destruction of sorrow (Na Tāvat Sukhaṁ Śānti Santāpa Nāśaṁ)."
          }
        },
        {
          "id": "rudrashtakam-1-8",
          "verse_number": 8,
          "original": "प्रसीद प्रभो सर्वभूताधिवासं\nन जानामि योगं जपं नैव पूजां\nनतोऽहं सदा सर्वदा शम्भु तुभ्यम्।\nजरा जन्म दुःखौघ तातप्यमानं\nप्रभो पाहि आपन्न मामीश शम्भो॥",
          "transliteration": "na jānāmi yōgaṁ japaṁ naiva pūjāṁ\nnatō'haṁ sadā sarvadā śambhu tubhyam |\njarā janma duḥkhaugha tātapyamānaṁ\nprabhō pāhi āpanna māmīśa śambhō ||",
          "translations": {
            "english": "I know neither Yoga, nor Japa (chanting), nor Pūjā (worship). I bow to you always, O Śambhu (Śambhu Tubhyam). O Lord (Prabhō), O Master (Īśa), O Giver of bliss (Śambhō), protect me, the distressed one (Āpanna Māmi), who is burning with the host of miseries of old age and birth (Jarā Janma Duḥkhaugha Tātapyamānaṁ)."
          }
        }
      ]
    },
    {
      "chapter_number": 2,
      "name": "Phala Shruti (Benefits of Recitation)",
      "verses_count": 1,
      "verses": [
        {
          "id": "rudrashtakam-2-1",
          "verse_number": 9,
          "original": "रुद्राष्टकमिदं प्रोक्तं विप्रेण हरतोषये\nये पठन्ति नरा भक्त्या तेषां शम्भुः प्रसीदति॥",
          "transliteration": "rudrāṣṭakamidaṁ prōktaṁ viprēṇa haratōṣayē\nyē paṭhanti narā bhaktyā tēṣāṁ śambhuḥ prasīdati ||",
          "translations": {
            "english": "This Rudrashtakam was composed by the Brahmin (Viprēṇa) for the satisfaction of Hara (Lord Shiva). Those people who recite it with devotion (Bhaktyā), Śambhu (Lord Shiva) is pleased with them (Tēṣāṁ Śambhuḥ Prasīdati)."
          }
        }
      ]
    }
  ]
}
