{
  "author": "Vedic Hymn (attributed to various Rishis)",
  "chapters": [
    {
      "audioUrl": "https://example.com/rudram/namakam/anuvaka1.mp3",
      "chapter_number": 1,
      "name": "Namakam",
      "summary": "Namakam, the first part of Sri Rudram, is a series of salutations (Namah) to Lord Rudra. It praises Rudra's omnipresent and multifaceted forms, acknowledging both his fierce and benevolent aspects. Each Anuvaka focuses on different attributes, names, and manifestations of Rudra, seeking his grace and protection from various dangers, while also praying for peace and prosperity.",
      "verses": [
        {
          "id": "namakam-1-1",
          "original": "ॐ नमो भगवते रुद्राय",
          "translations": {
            "english": "Om. Salutations to Lord Rudra."
          },
          "transliteration": "oṃ namo bhagavate rudrāya",
          "verse_number": 1
        },
        {
          "id": "namakam-1-2",
          "original": "नमस्त एस्तु भगवन् विश्वेश्वराय महादेवाय त्र्यम्बकाय त्रिपुरान्तकाय त्रिकाग्निकालाय कालाग्निरुद्राय नीलकण्ठाय मृत्युञ्जयाय सर्वेश्वराय सदाशिवाय श्रीमन् महादेवाय नमः",
          "translations": {
            "english": "Salutations to Thee, O Lord, the Lord of the universe, the Great God, the three-eyed one, the destroyer of Tripura, the annihilator of the three fires, Rudra as the fire of time, the blue-necked one, the conqueror of death, the Lord of all, the eternally auspicious one, the glorious Great God."
          },
          "transliteration": "namas ta estu bhagavan viśveśvarāya mahādevāya tryambakāya tripurāntakāya trikāgnikālāya kālāgnirudrāya nīlakaṇṭhāya mṛtyuñjayāya sarveśvarāya sadāśivāya śrīman mahādevāya namaḥ",
          "verse_number": 2
        },
        {
          "id": "namakam-1-3",
          "original": "नमो हिरण्यबाहवे सेनान्ये दिशां च पतये नमो नमो वृक्षेभ्यो हरिकेशेभ्यः पशूनां पतये नमो नमः सस्पिञ्जराय त्विषीमते पथीनां पतये नमो नमो बभ्लुशाय विव्याधिने ऽन्नानां पतये नमो नमो हरिकेशायोपवीतिने पुष्टानां पतये नमो नमो भवस्य हेत्यै जगतां पतये नमो नमो रुद्राय तताविने क्षेत्राणां पतये नमो नमः सूतायाहन्त्याय वनानां पतये नमो नमः रोहिताय स्थपतये वृक्षाणां पतये नमो नमो मन्त्रिणे वाणिजाय कक्षाणां पतये नमो नमो भुवन्तये वारिवस्कृतायौषधीनां पतये नमो नमः उच्चैर्घोषायाक्रन्दयते पत्तीनां पतये नमः",
          "translations": {
            "english": "Salutations to Him with golden arms, to the commander of armies, and to the lord of directions. Salutations to the green-haired trees, to the lord of animals. Salutations to the golden-red, radiant one, to the lord of paths. Salutations to the tawny-colored, piercing one, to the lord of food. Salutations to the green-haired, sacred-thread wearing one, to the lord of the nourished. Salutations to the cause of existence, to the lord of the worlds. Salutations to Rudra, the one who expands, to the lord of fields. Salutations to the charioteer, the unconquerable, to the lord of forests. Salutations to the red one, the architect, to the lord of trees. Salutations to the counselor, the merchant, to the lord of hidden places. Salutations to the creator of beings, the bestower of boons, to the lord of herbs. Salutations to the one with loud shouts, who causes cries, to the lord of foot-soldiers."
          },
          "transliteration": "namo hiraṇyabāhave senānye diśāṁ ca pataye namo namo vṛkṣebhyo harikeśebhyaḥ paśūnāṁ pataye namo namaḥ saspiñjarāya tviṣīmate pathīnāṁ pataye namo namo babhluśāya vivyādhine 'nnānāṁ pataye namo namo harikeśāyopavītine puṣṭānāṁ pataye namo namo bhavasya hetyai jagatāṁ pataye namo namo rudrāya tatāvine kṣetrāṇāṁ pataye namo namaḥ sūtāyāhantyāya vanānāṁ pataye namo namaḥ rohitāya sthapataye vṛkṣāṇāṁ pataye namo namo mantriṇe vāṇijāya kakṣāṇāṁ pataye namo namo bhuvantaye vārivaskṛtāyauṣadhīnāṁ pataye namo namaḥ uccairghoṣāyākrandayate pattīnāṁ pataye namaḥ",
          "verse_number": 3
        },
        {
          "id": "namakam-2-1",
          "original": "नमो हिरण्यबाहवे हिरण्यवर्णाय हिरण्यरूपाय हिरण्यपतये अम्बिकापतये उमापतये पशुपतये नमो नमः",
          "translations": {
            "english": "Salutations to Him with golden arms, of golden color, of golden form, the Lord of gold, the consort of Ambika, the consort of Uma, the Lord of all beings."
          },
          "transliteration": "namo hiraṇyabāhave hiraṇyavarṇāya hiraṇyarūpāya hiraṇyapataye ambikāpataye umāpataye paśupataye namo namaḥ",
          "verse_number": 12
        },
        {
          "id": "namakam-2-2",
          "original": "नमो भवाय च रुद्राय च नमः शर्वाय च पशुपतये च",
          "translations": {
            "english": "Salutations to Bhava and to Rudra. Salutations to Sharva and to Pashupati."
          },
          "transliteration": "namo bhavāya ca rudrāya ca namaḥ śarvāya ca paśupataye ca",
          "verse_number": 13
        },
        {
          "id": "namakam-2-3",
          "original": "नमो नीलग्रीवाय च शितिकण्ठाय च नमः कपर्दिने च व्युप्तकेशाय च",
          "translations": {
            "english": "Salutations to the blue-necked and the white-throated. Salutations to the one with matted hair and the one with shaven head."
          },
          "transliteration": "namo nīlagrīvāya ca śitikaṇṭhāya ca namaḥ kapardine ca vyuptakeśāya ca",
          "verse_number": 14
        }
      ],
      "verses_count": 66
    },
    {
      "audioUrl": "https://example.com/rudram/chamakam/anuvaka1.mp3",
      "chapter_number": 2,
      "name": "Chamakam",
      "summary": "Chamakam, the second part of Sri Rudram, is a fervent prayer for the fulfillment of all desires and needs, both material and spiritual. It lists hundreds of auspicious things, concepts, and entities, using the repetitive phrase 'cha me' (and to me), indicating a plea for these blessings to be granted. It embodies the human desire for holistic well-being, encompassing health, wealth, knowledge, progeny, and spiritual liberation, all sought through the grace of Lord Rudra.",
      "verses": [
        {
          "id": "chamakam-1-1",
          "original": "अग्नौ च मे देव सवितरि चाग्नावभ्यग्रे च मे",
          "translations": {
            "english": "May fire be mine, and Savitar, O God, and may the fire at the front be mine."
          },
          "transliteration": "agnau ca me deva savitari cāgnāvabhyagre ca me",
          "verse_number": 1
        },
        {
          "id": "chamakam-1-2",
          "original": "वाजे च मे प्रसवो च मे प्रयतिश्च मे प्रसितिश्च मे धीतिश्च मे क्रतुश्च मे स्वरश्च मे श्लोकश्च मे श्रावश्च मे श्रुतिश्च मे",
          "translations": {
            "english": "May food be mine, and its production, and effort, and accomplishment, and thought, and resolve, and voice, and fame, and listening, and hearing."
          },
          "transliteration": "vaje ca me prasavo ca me prayatiśca me prasitiśca me dhītiśca me kratuśca me svaraśca me ślokaśca me śrāvaśca me śrutiśca me",
          "verse_number": 2
        },
        {
          "id": "chamakam-1-3",
          "original": "ज्योतिश्च मे तपश्च मे व्रतञ्च मे तपो च मे दमश्च मे शमश्च मे",
          "translations": {
            "english": "May light be mine, and austerity, and vows, and penance, and self-restraint, and tranquility."
          },
          "transliteration": "jyotiśca me tapaśca me vratañca me tapo ca me damaśca me śamaśca me",
          "verse_number": 3
        },
        {
          "id": "chamakam-2-1",
          "original": "इमं मे वरुण श्रुधी हवमद्या च मृळय त्वामवस्युराचके",
          "translations": {
            "english": "O Varuna, hear this call of mine today, and be gracious. I, desiring protection, invoke you."
          },
          "transliteration": "imaṁ me varuṇa śrudhī havamadyā ca mṛḷaya tvāmavasyurācake",
          "verse_number": 12
        },
        {
          "id": "chamakam-2-2",
          "original": "त्वं नो अग्ने मह्यं वरुणाय ते नमः",
          "translations": {
            "english": "You, O Agni, are ours. To Varuna, salutations to you."
          },
          "transliteration": "tvaṁ no agne mahyaṁ varuṇāya te namaḥ",
          "verse_number": 13
        },
        {
          "id": "chamakam-2-3",
          "original": "आपो हि ष्ठा मयोभुवः ता न ऊर्जे दधातन महे रणाय चक्षसे",
          "translations": {
            "english": "O Waters, you are verily the source of joy. Bestow upon us strength, for great delight and vision."
          },
          "transliteration": "āpo hi ṣṭhā mayobhuvaḥ tā na ūrje dadhātana mahe raṇāya cakṣase",
          "verse_number": 14
        }
      ],
      "verses_count": 66
    }
  ],
  "id": "sri-rudram",
  "introduction": "Sri Rudram is a profound Vedic hymn dedicated to Lord Rudra (an epithet of Shiva). It is found in the Taittiriya Samhita of the Krishna Yajurveda. The text consists of two main parts, Namakam and Chamakam, each containing eleven sections called Anuvakas. Namakam, meaning 'salutations,' invokes Rudra in various aspects and forms, seeking his benevolent nature. Chamakam, meaning 'to me,' is a prayer for the fulfillment of all desires and needs, listing various auspicious things. Chanting Sri Rudram is considered highly sacred and beneficial, believed to purify the mind, body, and surroundings, and bestow spiritual and material well-being.",
  "title": "Sri Rudram"
}
