[
  {
    "id": "gita",
    "title": "Bhagavad Gita",
    "author": "Veda Vyasa (as part of the Mahabharata)",
    "path": "bhagavadGita.json",
    "coverImage": "images/KrishaArjuna.png"
  },
  {
    "id": "chalisa",
    "title": "Hanuman Chalisa",
    "author": "Tulsidas",
    "path": "hanumanChalisa.json",
    "coverImage": "images/HanumanChalisa.png"
  },
  {
    "id": "lalita",
    "title": "Lalita Sahasranama",
    "author": "Sage Hayagrīva (narrated in Brahmanda Purana)",
    "path": "lalitaSahasranama.json",
    "coverImage": "images/LalithaSahasranama.png"
  },
  {
    "id": "shiva",
    "title": "Shiva Tandava Stotram",
    "author": "Ravana",
    "path": "shivaTandavaStotram.json",
    "coverImage": "images/ShivaTandav.png"
  },
  {
    "id": "vishnu",
    "title": "Vishnu Sahasranama",
    "author": "Veda Vyasa (from the Mahabharata, Anushasana Parva)",
    "path": "vishnuSahasranama.json",
    "coverImage": "images/VishnuSahasranama.png"
  },
  {
    "id": "soundarya-lahari",
    "introduction": "The Soundarya Lahari ('Waves of Beauty') is a famous Sanskrit literary work attributed to Adi Shankara. It is a devotional poem of one hundred verses (shlokas) praising Goddess Parvati as the supreme divine mother, depicted in various aspects of beauty, grace, and power. The first 41 verses are known as 'Ananda Lahari' (Waves of Bliss), focusing on the Kundalini yoga and the mystical aspects of the Sri Chakra. The remaining 59 verses are called 'Soundarya Lahari' (Waves of Beauty), describing the physical beauty of the Goddess from head to toe. It is a profound work that blends devotion, Tantric philosophy, and aesthetics, revered by devotees and scholars alike for its lyrical beauty and spiritual depth.",
    "title": "Soundarya Lahari",
    "author": "Adi Shankara",
    "path": "soundaryaLahiri.json",
    "coverImage": "images/soundaryaLahari.png"
  },
  {
    "id": "thiruPugazh",
    "introduction": "Thiruppugazh is a 14th‑century Tamil devotional anthology composed by the saint Arunagirinathar in praise of Lord Murugan. It contains around 1,336 verses (songs), though some traditions count slightly fewer or more depending on manuscripts.",
    "title": "Thiruppugazh",
    "author": "Arunagirinathar",
    "path": "thiruPugazh.json",
    "coverImage": "images/Murugan_by_Raja_Ravi_Varma.jpg"
  },
  {
    "id": "thiruppavai",
    "title": "Thiruppavai (திருப்பா\nவை)",
    "author": "Andal (Aṇḍāḷ / Gōdā Dēvi)",
    "introduction": "Thiruppavai is a collection of thirty verses (Pāsurams) in Tamil written by Andal, one of the twelve Alvars. These verses are recited during the auspicious month of Mārkaḻi (mid-December to mid-January).\n\nThe text is structured as a 'Gopi Vratam,' a vow undertaken by the Gopis (cowherd girls) of Ayppāḍi (Gokulam). The ultimate goal is to awaken Lord Krishna and obtain his grace, which is represented by the 'Parai' (a divine reward/drum). The verses progress from invoking the rains, stating the rules of the vow, waking up fellow Gopis, waking up Krishna and his family, requesting boons, and concluding with the Phalashruti (the fruit of reading the text).",
    "path": "thiruPPavai.json",
    "coverImage": "images/thiruPPavai.png"
  }
]
